{
  "header": {
    "home": "Home",
    "about": "About",
    "career": "Career",
    "projects": "Projects",
    "testimonials": "Testimonials",
    "contact": "Contact",
    "resume": "Resume"
  },
  "home" : {
    "hi_my_name_is": "Hi, my name is",
    "subtitle": "Let's grow your business into the digital world",
    "get_in_touch": "Get in touch"
  },
  "aboutMe": {
    "title": "Let me introduce myself",
    "text": [
      "I've been working in the software engineering field for the past 6 years, specializing as a Full-Stack Web Developer. My career started as a Ruby on Rails intern working on projects such as a Stocks Portfolio Management System and a Freight Management System.",
      "Afterwards I started experimenting with Java and worked on 2 eCommerce projects, one using Spring Boot and Hibernate and one using SAP Hybris. However, after about a year and a half, I returned to my first tech love: Ruby 😄.",
      "I've worked for 2 years on a huge Golf Tournament Management System helping me become a true Senior Engineer and even being promoted to a management position inside the company for a short while.",
      "Lately I've discovered freelancing and my goal slowly became helping business owners build solid web systems that would finally allow them more time for their personal lives while also increasing their revenues. So far I've worked with businesses in the US as well as in Ireland and all the feedback I received was extremely positive.",
      "So let's get in touch and start working on the business and life of your dreams 🚀"
    ]
  },
  "careers": [
    {
      "name": "Freelancing via Toptal @&Open",
      "period": "Sep 2022 - Feb 2023",
      "description": "I was responsible with improving the experience of Customer Support Managers by adding new features such as:",
      "items": [
        "Built an administrative page for campaigns removing 80% of the software engineers' support work related to this area of the project",
        "Helped with the integration of a new client by customizing 2 new themes for their React front-end and for their Slim email templates",
        "Surfaced to the UI errors coming from fulfiller integrations enabling CSM's to solve their issues independently and removing another 20% of engineers' needed support"
      ]
    },
    {
      "name": "Freelancing via Toptal @Influence Mobile",
      "period": "Mar 2021 - Aug 2022",
      "description": "",
      "items": [
        "Designed and developed a new web application from the ground up, using Ruby on Rails 6 and React 17+, to manage various mobile games' and apps' campaigns and offers for more than 100 clients",
        "Integrated the new app with existing systems by using AWS's SQS to keep both systems in sync while handling 1000+ messages per day",
        "Created a real-time notification system by using web sockets to inform users of specific messages processed through the SQS queue to improve user experience from a score of 7.3 to 8.6",
        "Handled production deployments and maintenance of the web app while keeping a test coverage above 90%",
        "Collaborated closely with the PM and the clients by having weekly and daily meetings to establish new features and find solutions for existing issues"
      ]
    },
    {
      "name": "Freelancing via Toptal @Spaceback",
      "period": "Mar 2021 - Jun 2021",
      "description": "",
      "items": [
        "Improved error tracking and the time required for debugging by 80%, by adding new relevant details to the context of the errors reported",
        "Refactored 7 classes used to parse webpages by extracting the common functionality into a superclass and using inheritance and composition",
        "Adapted 1 page written in Stimulus to include React Components in order to improve code readability and page loading times"
      ]
    },
    {
      "name": "Take Off Labs",
      "period": "Feb 2019 - Mar 2021",
      "description": "",
      "items": [
        "Added 10+ endpoints to a REST API used by iOS and Android mobile apps, to allow golf players to register for events and track scores",
        "Converted a classic HAML Ruby page to React components and improved the response times from about 30 seconds to 3 seconds per request using caching, pagination, and other optimization methods",
        "Engineered an integration system with a different provider to synchronize more than 10000 golf players' data, both on a daily basis as well as whenever an SSO sign-in occurred",
        "Generated a new Player Dashboard using React and Ruby on Rails accessed by 1000+ users daily",
        "Extended the member profile page with 2 new pages loaded asynchronously through AJAX requests",
        "Created 1 background job to handle multi-threaded requests to an external API and process the results"
      ]
    },
    {
      "name": "Accesa",
      "period": "Jul 2018 - Feb 2019",
      "description": "",
      "items": [
        "Participated in creating an internal management tool for the HR department to track the interview processes for new internship candidates, by utilizing Java 8, Angular 2, PostgreSQL, and CQRS as an architecture",
        "Contributed to a B2B eCommerce platform for tracking orders to and from multiple physical stores, using Java 8 and Angular 2",
        "Experienced working in the Hybris ecosystem through an application built for training purposes in less than 6 weeks"
      ]
    },
    {
      "name": "Take Off Labs",
      "period": "Feb 2016 - Jul 2018",
      "description": "Joined Take Off Labs as an intern, giving me the opportunity to work on a variety of projects:",
      "items": [
        "Developed a Stock Portfolio Management System which required scraping data from 2 sources: Yahoo Finance and Bucharest Stock Exchange",
        "Worked on a Freight Management System by adding 50+ features and bug fixes",
        "Improved the responsiveness of the company's website using Bootstrap 3 classes and helpers"
      ]
    }
  ],
  "projects": [
    {
      "name": "Draw Cells",
      "url": "https://draw-cells.netlify.app",
      "image": "iMac",
      "description":
        "A project co-founded by me and my friend Jane who is a PhD at Oxford. The aim of the platform is to make presentations easier and less time consuming for scientists",
      "items": [
        "Was built with React 17+ and currently has a Firebase back-end",
        "Uses Konva as a canvas library allowing users to drag and drop, resize and do all kinds of customizations for their sprites",
        "Uses React Spring 4 as an animation tool"
      ]
    },
    {
      "name": "Flourish",
      "url": "",
      "image": "macbook",
      "description":
        "Flourish was created as a replacement for a company's service that used to manage campaigns and offers for mobile games and apps. The project was designed and built by me to help the company I was working for with their business",
      "items": [
        "Created with Ruby on Rails 6 for the back-end and React for the front-end",
        "Integrated with a legacy systems by using AWS's SQS queing system",
        "Built a real-time notification system for the users to know when their offers or campaings stopped working"
      ]
    },
    {
      "name": "eCommerce API",
      "url": "https://github.com/butiricristian/eCommerce-node-acc",
      "image": "apiImage",
      "description":
        "As a participant in Toptal's Node.js accelerator program, I was assigned with building 2 demo eCommerce services: a user authentication service and a product management service",
      "items": [
        "The user service was built using Node.js, Express and Auth0 as an authentication server",
        "The products service was created with Node.js, Nest and MongoDB as a database",
        "Both services were exposing REST APIs documented with the help of Swagger"
      ]
    }
  ],
  "testimonials": [
    {
      "avatar": "ziv",
      "author": "Ziv Gonen",
      "role": "VP of Engineering @Influnece Mobile",
      "description":
        "I personally worked with Cristian during the first half of the project to launch and further improve the application. Cristian exhibited a unique combination of business, product and engineering skills, creating compelling UX and UI while maintaining a strong architecture and speedy performance. Cristian has great communication skills and is a delight to work with. I would definitely recommend Cristian and would love to work with him again in the future.",
      "rating": 5
    },
    {
      "avatar": "john",
      "author": "John Farrel",
      "role": "Lead Software Engineer @&Open",
      "description":
        "Cristian is a true full stack developer with a high level of skill through the entire stack from the frontend ReactJS code, right down to the backend/database and everything in between. In a company where we have teams split between Frontend and Backend, this was an impressive feat! Every line of code he wrote was to an extremely high standard. He contributed so much to our codebase over the course of a few months, it really was impressive. Not only was his code quality excellent, but also his ability to take a sometimes vague user request, understand the ask, and turn it into well refined development tasks that we could all progress with together as a team to meet the original request. It's been such a pleasure to work with you, hopefully our paths will cross again in the future! Wishing you all the best on your next adventure.",
      "rating": 5
    },
    {
      "avatar": "jane",
      "author": "Jane Pernes",
      "role": "PhD Student @University of Oxford",
      "description":
        "I have personally known Cristian for over 12 years, and can attest that he has always been an incredibly driven and focused individual. As co-founders, we have been working together in a professional manner for over a year. His knowledge, resourcefulness and  dedication are truly impressive. He has always strived for excellence in every task he took on. It’s been such a privilege to have been working together.",
      "rating": 5
    }
  ],
  "footer": {
    "want_to_digitalize_your_business": "Want to digitalize your business?",
    "lets_get_in_touch": "Let's get in touch",
    "made_by": "Made by Cristian Butiri © 2023"
  }
}